Revit 2024 API
BuiltInFailures.ElectricalFailures.NotEnoughSlotsOnlyLugAvailableForSwitchPanel Property
 There aren't enough space on switchboard [Panel Name], so the circuit will connect through Feed Through Lugs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotEnoughSlotsOnlyLugAvailableForSwitchPanel { get; }
Visual Basic
Public Shared ReadOnly Property NotEnoughSlotsOnlyLugAvailableForSwitchPanel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotEnoughSlotsOnlyLugAvailableForSwitchPanel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace